<a href="https://colab.research.google.com/github/Anna-Tereshchuk/ETL_with_Python_and_SQL/blob/main/Window_func_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd


> Завантаження даних  з Excel файлу

In [4]:
employees = pd.read_excel('/content/H+ Sport Employees.xlsx', sheet_name='Employees-Table')



> Перегляд даних

In [5]:
print(employees.head())

      Employee Name Building Department     Status  Hire Date Month  Years  \
0        Page, Lisa     West        ADC  Full Time 1999-01-11   Jan     25
1    Taylor, Hector     West        ADC  Half-Time 2011-02-21   Feb     12
2  Dawson, Jonathan     West        ADC   Contract 2007-03-06   Mar     16
3      Duran, Brian     Taft        ADC     Hourly 2012-08-30   Aug     11
4      Weber, Larry   Watson        ADC  Full Time 2007-12-31   Dec     16

  Benefits  Salary  Job Rating  New Salary  Tax Rate  2.91%
0      DMR   24550           1         NaN       NaN    NaN
1       DM   26795           4         NaN       NaN    NaN
2      NaN   42540           5         NaN       NaN    NaN
3      NaN   35680           2         NaN       NaN    NaN
4        M   72830           2         NaN       NaN    NaN



>Вибір стовпців для видалення

In [6]:
columns_to_remove = ['Job Rating', 'New Salary', 'Tax Rate', '2.91%']



> метод `drop` для видалення зазначених стовпців

In [7]:
employees = employees.drop(columns=columns_to_remove)



> Перевірка оновленого DataFrame

In [8]:
print(employees.columns)

Index(['Employee Name', 'Building', 'Department', 'Status', 'Hire Date',
       'Month', 'Years', 'Benefits', 'Salary'],
      dtype='object')

In [9]:
from sqlalchemy import create_engine

In [10]:
DATABASE_URL = "postgresql://sql_engine_user:rzdZBwzXrwzvMAaepHFPMYXvYQQQ3431@dpg-cucb7n2j1k6c73b809lg-a.oregon-postgres.render.com/sql_engine"

# Створення підключення
engine = create_engine(DATABASE_URL)

try:
    connection = engine.connect()
    print("Успішно підключено до бази даних!")
    connection.close()
except Exception as e:
    print(f"Помилка підключення: {e}")

Успішно підключено до бази даних!

In [11]:
employees.to_sql('employees_cleaned', con=engine, if_exists='replace', index=False)
print("Дані завантажено до бази!")

Дані завантажено до бази!

**Перевірка даних у базі**

In [12]:
from sqlalchemy import text

# Перевіряємо, чи створені таблиці
with engine.connect() as conn:
    result = conn.execute(text("SELECT table_name FROM information_schema.tables WHERE table_schema = 'public';"))
    for row in result:
        print(row)

('employees_cleaned',)



> Для перевірки перших записів у таблиці

In [13]:
# Переглядаємо перші 5 записів у таблиці
with engine.connect() as conn:
    result = conn.execute(text("SELECT * FROM employees_cleaned LIMIT 5;"))
    for row in result:
        print(row)

('Page, Lisa', 'West', 'ADC', 'Full Time', datetime.datetime(1999, 1, 11, 0, 0), 'Jan', 25, 'DMR', 24550)
('Taylor, Hector', 'West', 'ADC', 'Half-Time', datetime.datetime(2011, 2, 21, 0, 0), 'Feb', 12, 'DM', 26795)
('Dawson, Jonathan', 'West', 'ADC', 'Contract', datetime.datetime(2007, 3, 6, 0, 0), 'Mar', 16, None, 42540)
('Duran, Brian', 'Taft', 'ADC', 'Hourly', datetime.datetime(2012, 8, 30, 0, 0), 'Aug', 11, None, 35680)
('Weber, Larry', 'Watson', 'ADC', 'Full Time', datetime.datetime(2007, 12, 31, 0, 0), 'Dec', 16, 'M', 72830)



> Підрахунок кількості записів

In [14]:
# Підрахунок кількості рядків у таблиці
with engine.connect() as conn:
    result = conn.execute(text("SELECT COUNT(*) FROM employees_cleaned;"))
    print("Кількість записів:", result.scalar())

Кількість записів: 741

In [15]:
query = """
SELECT column_name
FROM information_schema.columns
WHERE table_name = 'employees_cleaned';


"""

In [16]:
with engine.connect() as conn:
    result = conn.execute(text("SELECT * FROM employees_cleaned LIMIT 5;"))
    for row in result:
        print(row)

('Page, Lisa', 'West', 'ADC', 'Full Time', datetime.datetime(1999, 1, 11, 0, 0), 'Jan', 25, 'DMR', 24550)
('Taylor, Hector', 'West', 'ADC', 'Half-Time', datetime.datetime(2011, 2, 21, 0, 0), 'Feb', 12, 'DM', 26795)
('Dawson, Jonathan', 'West', 'ADC', 'Contract', datetime.datetime(2007, 3, 6, 0, 0), 'Mar', 16, None, 42540)
('Duran, Brian', 'Taft', 'ADC', 'Hourly', datetime.datetime(2012, 8, 30, 0, 0), 'Aug', 11, None, 35680)
('Weber, Larry', 'Watson', 'ADC', 'Full Time', datetime.datetime(2007, 12, 31, 0, 0), 'Dec', 16, 'M', 72830)

In [17]:
DATABASE_URL = "postgresql://sql_engine_user:rzdZBwzXrwzvMAaepHFPMYXvYQQQ3431@dpg-cucb7n2j1k6c73b809lg-a.oregon-postgres.render.com/sql_engine"
engine = create_engine(DATABASE_URL)

In [18]:
from sqlalchemy import create_engine, text

DATABASE_URL = "postgresql://sql_engine_user:rzdZBwzXrwzvMAaepHFPMYXvYQQQ3431@dpg-cucb7n2j1k6c73b809lg-a.oregon-postgres.render.com/sql_engine"
engine = create_engine(DATABASE_URL)

# List columns
with engine.connect() as conn:
    result = conn.execute(text("SELECT column_name FROM information_schema.columns WHERE table_name = 'employees_cleaned';"))
    for row in result:
        print(row)

('Salary',)
('Hire Date',)
('Years',)
('Status',)
('Benefits',)
('Month',)
('Employee Name',)
('Building',)
('Department',)

**Віконна функція `ROW_NUMBER()`**

Віконні функції дозволяють виконувати обчислення по групах рядків, які визначаються вікном. В даному випадку ми використовуємо функцію ROW_NUMBER(), яка присвоює унікальний номер кожному рядку в межах визначеного вікна.


*   `ROW_NUMBER() OVER (PARTITION BY column1 ORDER BY column2)`
*   **PARTITION BY:** Розбиває результати на групи на основі значень у вказаній колонці (в нашому випадку це “Department”).


*   **ORDER BY:** Визначає порядок сортування рядків у кожній групі (в нашому випадку це “Salary” у спадному порядку).

*   **Що робить цей запит:**


1.   **Вибирає колонки:** “Employee Name”, “Department”, “Salary”.
2.  Використовує `віконну функцію ROW_NUMBER()`

*  PARTITION BY “Department”: Розбиває результати на групи за відділами.
*   ORDER BY “Salary” DESC: Сортує кожну групу за зарплатою у спадному порядку.


3.   **Присвоює номер рядку:** Присвоює унікальний номер кожному рядку в межах кожного відділу, починаючи з 1 для найвищої зарплати.

In [19]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    ROW_NUMBER() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as RowNum
FROM
    employees_cleaned;
"""

df_window = pd.read_sql_query(query, engine)
print(df_window)

           Employee Name          Department  Salary  rownum
0          Cameron, John  Account Management   89640       1
1    Villarreal, Stephen  Account Management   88820       2
2         Burnett, Kevin  Account Management   86500       3
3        Holloway, Chris  Account Management   85980       4
4         Herrera, Shawn  Account Management   79400       5
..                   ...                 ...     ...     ...
736      Brewer, Khurrum            Training   30445      13
737      Holland, Donald            Training   29070      14
738   Strickland, Rajean            Training   17735      15
739        Oconnor, Kent            Training   15240      16
740   Gallagher, Johnson            Training   10636      17

[741 rows x 4 columns]

**RANK()**



> Функція RANK() присвоює ранг кожному рядку в межах вікна. Якщо є однакові значення, вони отримують однаковий ранг, а наступний ранг пропускається.

In [20]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    RANK() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as Rank
FROM
    employees_cleaned;
"""

df_rank = pd.read_sql_query(query, engine)
print(df_rank)

           Employee Name          Department  Salary  rank
0          Cameron, John  Account Management   89640     1
1    Villarreal, Stephen  Account Management   88820     2
2         Burnett, Kevin  Account Management   86500     3
3        Holloway, Chris  Account Management   85980     4
4         Herrera, Shawn  Account Management   79400     5
..                   ...                 ...     ...   ...
736      Brewer, Khurrum            Training   30445    13
737      Holland, Donald            Training   29070    14
738   Strickland, Rajean            Training   17735    15
739        Oconnor, Kent            Training   15240    16
740   Gallagher, Johnson            Training   10636    17

[741 rows x 4 columns]

**DENSE_RANK()**


> Функція DENSE_RANK() схожа на RANK(), але не пропускає ранги при однакових значеннях.

In [21]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    DENSE_RANK() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as DenseRank
FROM
    employees_cleaned;
"""

df_dense_rank = pd.read_sql_query(query, engine)
print(df_dense_rank)

           Employee Name          Department  Salary  denserank
0          Cameron, John  Account Management   89640          1
1    Villarreal, Stephen  Account Management   88820          2
2         Burnett, Kevin  Account Management   86500          3
3        Holloway, Chris  Account Management   85980          4
4         Herrera, Shawn  Account Management   79400          5
..                   ...                 ...     ...        ...
736      Brewer, Khurrum            Training   30445         13
737      Holland, Donald            Training   29070         14
738   Strickland, Rajean            Training   17735         15
739        Oconnor, Kent            Training   15240         16
740   Gallagher, Johnson            Training   10636         17

[741 rows x 4 columns]

**NTILE()**


> Функція NTILE() розбиває результати на задану кількість груп і присвоює номер групи кожному рядку.

In [22]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    NTILE(4) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as Quartile
FROM
    employees_cleaned;
"""

df_ntile = pd.read_sql_query(query, engine)
print(df_ntile)

           Employee Name          Department  Salary  quartile
0          Cameron, John  Account Management   89640         1
1    Villarreal, Stephen  Account Management   88820         1
2         Burnett, Kevin  Account Management   86500         1
3        Holloway, Chris  Account Management   85980         1
4         Herrera, Shawn  Account Management   79400         1
..                   ...                 ...     ...       ...
736      Brewer, Khurrum            Training   30445         3
737      Holland, Donald            Training   29070         4
738   Strickland, Rajean            Training   17735         4
739        Oconnor, Kent            Training   15240         4
740   Gallagher, Johnson            Training   10636         4

[741 rows x 4 columns]

**LAG()**


> Функція LAG() дозволяє отримати значення з попереднього рядка в межах вікна.

Як бачите, для першого рядка значення PrevSalary є NaN, оскільки немає попереднього рядка. Для кожного наступного рядка значення PrevSalary відповідає зарплаті попереднього співробітника в межах того ж відділу.

In [23]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    LAG("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as PrevSalary
FROM
    employees_cleaned;
"""

df_lag = pd.read_sql_query(query, engine)
print(df_lag)

           Employee Name          Department  Salary  prevsalary
0          Cameron, John  Account Management   89640         NaN
1    Villarreal, Stephen  Account Management   88820     89640.0
2         Burnett, Kevin  Account Management   86500     88820.0
3        Holloway, Chris  Account Management   85980     86500.0
4         Herrera, Shawn  Account Management   79400     85980.0
..                   ...                 ...     ...         ...
736      Brewer, Khurrum            Training   30445     30780.0
737      Holland, Donald            Training   29070     30445.0
738   Strickland, Rajean            Training   17735     29070.0
739        Oconnor, Kent            Training   15240     17735.0
740   Gallagher, Johnson            Training   10636     15240.0

[741 rows x 4 columns]

**LEAD()**


> Функція LEAD() дозволяє отримати значення з наступного рядка в межах вікна.

Як бачите, для кожного рядка значення NextSalary відповідає зарплаті наступного співробітника в межах того ж відділу. Для останнього рядка значення NextSalary може бути NaN, якщо немає наступного рядка.

In [24]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    LEAD("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as NextSalary
FROM
    employees_cleaned;
"""

df_lead = pd.read_sql_query(query, engine)
print(df_lead)

           Employee Name          Department  Salary  nextsalary
0          Cameron, John  Account Management   89640     88820.0
1    Villarreal, Stephen  Account Management   88820     86500.0
2         Burnett, Kevin  Account Management   86500     85980.0
3        Holloway, Chris  Account Management   85980     79400.0
4         Herrera, Shawn  Account Management   79400     79380.0
..                   ...                 ...     ...         ...
736      Brewer, Khurrum            Training   30445     29070.0
737      Holland, Donald            Training   29070     17735.0
738   Strickland, Rajean            Training   17735     15240.0
739        Oconnor, Kent            Training   15240     10636.0
740   Gallagher, Johnson            Training   10636         NaN

[741 rows x 4 columns]

**SUM()**


> Функція SUM() обчислює суму значень у межах вікна.

In [25]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    SUM("Salary") OVER (PARTITION BY "Department") as TotalSalary
FROM
    employees_cleaned;
"""

df_sum = pd.read_sql_query(query, engine)
print(df_sum)

          Employee Name          Department  Salary  totalsalary
0          Lawson, Erin  Account Management   69420    4431688.0
1       Bowman, Michael  Account Management   47520    4431688.0
2      Chapman, Jessica  Account Management   45750    4431688.0
3          Hunter, Lisa  Account Management   50570    4431688.0
4        Herrera, Shawn  Account Management   79400    4431688.0
..                  ...                 ...     ...          ...
736  Gallagher, Johnson            Training   10636     870456.0
737     Phillips, Liesl            Training   85300     870456.0
738         Burton, Cam            Training   58290     870456.0
739           Rowe, Ken            Training   76690     870456.0
740     Holland, Donald            Training   29070     870456.0

[741 rows x 4 columns]

**AVG()**


> Функція AVG() обчислює середнє значення у межах вікна.

In [26]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    AVG("Salary") OVER (PARTITION BY "Department") as AvgSalary
FROM
    employees_cleaned;
"""

df_avg = pd.read_sql_query(query, engine)
print(df_avg)

          Employee Name          Department  Salary     avgsalary
0          Lawson, Erin  Account Management   69420  50360.090909
1       Bowman, Michael  Account Management   47520  50360.090909
2      Chapman, Jessica  Account Management   45750  50360.090909
3          Hunter, Lisa  Account Management   50570  50360.090909
4        Herrera, Shawn  Account Management   79400  50360.090909
..                  ...                 ...     ...           ...
736  Gallagher, Johnson            Training   10636  51203.294118
737     Phillips, Liesl            Training   85300  51203.294118
738         Burton, Cam            Training   58290  51203.294118
739           Rowe, Ken            Training   76690  51203.294118
740     Holland, Donald            Training   29070  51203.294118

[741 rows x 4 columns]

 **COUNT()**  **(віконна версія)**


*   **Опис:** Повертає кількість рядків у вікні.

*   **Коли використовувати:** Коли потрібно підрахувати кількість записів у групі.

In [27]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    COUNT(*) OVER (PARTITION BY "Department") as TotalEmployees
FROM
    employees_cleaned;
"""

df_count = pd.read_sql_query(query, engine)
print(df_count)

          Employee Name          Department  Salary  totalemployees
0          Lawson, Erin  Account Management   69420              88
1       Bowman, Michael  Account Management   47520              88
2      Chapman, Jessica  Account Management   45750              88
3          Hunter, Lisa  Account Management   50570              88
4        Herrera, Shawn  Account Management   79400              88
..                  ...                 ...     ...             ...
736  Gallagher, Johnson            Training   10636              17
737     Phillips, Liesl            Training   85300              17
738         Burton, Cam            Training   58290              17
739           Rowe, Ken            Training   76690              17
740     Holland, Donald            Training   29070              17

[741 rows x 4 columns]

**FIRST_VALUE()**


*   **Опис:** Повертає перше значення у вікні, визначеному через `PARTITION BY` та `ORDER BY`
*   **Коли використовувати:** Якщо потрібно отримати перший запис у групі.

Повертає найвищу зарплату в кожному відділі (оскільки сортування у зворотному порядку).

In [28]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    FIRST_VALUE("Salary") OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as FirstSalary
FROM
    employees_cleaned;
"""

df_first = pd.read_sql_query(query, engine)
print(df_first)

           Employee Name          Department  Salary  firstsalary
0          Cameron, John  Account Management   89640        89640
1    Villarreal, Stephen  Account Management   88820        89640
2         Burnett, Kevin  Account Management   86500        89640
3        Holloway, Chris  Account Management   85980        89640
4         Herrera, Shawn  Account Management   79400        89640
..                   ...                 ...     ...          ...
736      Brewer, Khurrum            Training   30445        85300
737      Holland, Donald            Training   29070        85300
738   Strickland, Rajean            Training   17735        85300
739        Oconnor, Kent            Training   15240        85300
740   Gallagher, Johnson            Training   10636        85300

[741 rows x 4 columns]

**LAST_VALUE()**


*   Повертає останнє значення у вікні.
*   **Коли використовувати:** Якщо потрібно отримати останнє значення в групі.


```
Примітка: Для коректного використання треба вказати ROWS BETWEEN, щоб "останнє значення" враховувалося в межах усього вікна.

Для чого це потрібно: Наприклад, для отримання останнього запису за певним критерієм
```

In [29]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    LAST_VALUE("Salary") OVER (
        PARTITION BY "Department"
        ORDER BY "Salary" ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
    ) as LastSalary
FROM
    employees_cleaned;
"""

df_last = pd.read_sql_query(query, engine)
print(df_last)

        Employee Name          Department  Salary  lastsalary
0        Horn, George  Account Management   10630       89640
1     Rivers, Douglas  Account Management   10700       89640
2    Edwards, Phillip  Account Management   11810       89640
3       Curry, Hunyen  Account Management   12545       89640
4       Booth, Raquel  Account Management   14332       89640
..                ...                 ...     ...         ...
736     White, Daniel            Training   74840       85300
737    Wiggins, Frank            Training   75150       85300
738         Rowe, Ken            Training   76690       85300
739    Wilkins, Jesse            Training   79760       85300
740   Phillips, Liesl            Training   85300       85300

[741 rows x 4 columns]

**PERCENT_RANK()**


*   **Опис:** Обчислює відносний ранг рядка у відсотках (від 0 до 1), де перший рядок завжди має 0.
*   **Коли використовувати:** Коли потрібно порівняти рядок відносно решти даних у групі.


*  Повертає відсоткове положення рядка в межах відділу, враховуючи зарплату.


```
Це може бути корисно для аналізу позиції кожного рядка, наприклад, для нормалізації даних.
```

In [30]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    PERCENT_RANK() OVER (PARTITION BY "Department" ORDER BY "Salary") as PercentRank
FROM
    employees_cleaned;
"""

df_percent_rank = pd.read_sql_query(query, engine)
print(df_percent_rank)

        Employee Name          Department  Salary  percentrank
0        Horn, George  Account Management   10630     0.000000
1     Rivers, Douglas  Account Management   10700     0.011494
2    Edwards, Phillip  Account Management   11810     0.022989
3       Curry, Hunyen  Account Management   12545     0.034483
4       Booth, Raquel  Account Management   14332     0.045977
..                ...                 ...     ...          ...
736     White, Daniel            Training   74840     0.750000
737    Wiggins, Frank            Training   75150     0.812500
738         Rowe, Ken            Training   76690     0.875000
739    Wilkins, Jesse            Training   79760     0.937500
740   Phillips, Liesl            Training   85300     1.000000

[741 rows x 4 columns]

**CUME_DIST() (Cumulative Distribution)**



*   **Опис:** Визначає кумулятивну частоту (накопичений відсоток) для рядка в межах вікна.
*   **Коли використовувати:** Якщо потрібно визначити, який відсоток значень менший або дорівнює поточному значенню.



*   Вираховує частку працівників у відділі, зарплата яких менша або дорівнює поточній.


```
Для чого це потрібно: Наприклад, для аналізу розподілу зарплат у відділі.


```

In [31]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    CUME_DIST() OVER (PARTITION BY "Department" ORDER BY "Salary") as CumulativeDistribution
FROM
    employees_cleaned;
"""

df_cume_dist = pd.read_sql_query(query, engine)
print(df_cume_dist)

        Employee Name          Department  Salary  cumulativedistribution
0        Horn, George  Account Management   10630                0.011364
1     Rivers, Douglas  Account Management   10700                0.022727
2    Edwards, Phillip  Account Management   11810                0.034091
3       Curry, Hunyen  Account Management   12545                0.045455
4       Booth, Raquel  Account Management   14332                0.056818
..                ...                 ...     ...                     ...
736     White, Daniel            Training   74840                0.764706
737    Wiggins, Frank            Training   75150                0.823529
738         Rowe, Ken            Training   76690                0.882353
739    Wilkins, Jesse            Training   79760                0.941176
740   Phillips, Liesl            Training   85300                1.000000

[741 rows x 4 columns]

**NTH_VALUE()**


*   **Опис:** Повертає n-те значення у вікні.
*   **Коли використовувати:** Якщо потрібно отримати конкретне значення (наприклад, 3-тє за розміром) у групі.


*   Повертає третє за розміром значення зарплати у межах кожного відділу.

> Для чого це потрібно: Це зручно для вибірки певних позицій у ранжованих даних.

In [32]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    NTH_VALUE("Salary", 3) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as ThirdHighestSalary
FROM
    employees_cleaned;
"""

df_nth_value = pd.read_sql_query(query, engine)
print(df_nth_value)

           Employee Name          Department  Salary  thirdhighestsalary
0          Cameron, John  Account Management   89640                 NaN
1    Villarreal, Stephen  Account Management   88820                 NaN
2         Burnett, Kevin  Account Management   86500             86500.0
3        Holloway, Chris  Account Management   85980             86500.0
4         Herrera, Shawn  Account Management   79400             86500.0
..                   ...                 ...     ...                 ...
736      Brewer, Khurrum            Training   30445             76690.0
737      Holland, Donald            Training   29070             76690.0
738   Strickland, Rajean            Training   17735             76690.0
739        Oconnor, Kent            Training   15240             76690.0
740   Gallagher, Johnson            Training   10636             76690.0

[741 rows x 4 columns]

**MAX() та MIN() (віконна версія)**


*  **Опис:** Повертають максимальне або мінімальне значення у вікні.
*   **Коли використовувати:** Коли потрібно знайти екстремальні значення для кожної групи.


*   `MAX()` знаходить максимальну зарплату в межах відділу.
*   `MIN()` знаходить мінімальну зарплату.



**Для чого це потрібно:** Для аналізу екстремальних значень у даних, наприклад, найвищої та найнижчої зарплати в кожному відділі.

In [33]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    MAX("Salary") OVER (PARTITION BY "Department") as MaxSalary,
    MIN("Salary") OVER (PARTITION BY "Department") as MinSalary
FROM
    employees_cleaned;
"""

df_max_min = pd.read_sql_query(query, engine)
print(df_max_min)

          Employee Name          Department  Salary  maxsalary  minsalary
0          Lawson, Erin  Account Management   69420      89640      10630
1       Bowman, Michael  Account Management   47520      89640      10630
2      Chapman, Jessica  Account Management   45750      89640      10630
3          Hunter, Lisa  Account Management   50570      89640      10630
4        Herrera, Shawn  Account Management   79400      89640      10630
..                  ...                 ...     ...        ...        ...
736  Gallagher, Johnson            Training   10636      85300      10636
737     Phillips, Liesl            Training   85300      85300      10636
738         Burton, Cam            Training   58290      85300      10636
739           Rowe, Ken            Training   76690      85300      10636
740     Holland, Donald            Training   29070      85300      10636

[741 rows x 5 columns]

**MEDIAN() (Деякі СУБД)**


*   **Опис:** Обчислює медіанне значення у вікні (не підтримується всіма базами даних).
*  ** Коли використовувати:** Коли потрібно знайти центральне значення в упорядкованих даних.


*   Повертає медіанне значення зарплати для кожного відділу.


> **Для чого це потрібно:** Для аналізу "центральної тенденції" в зарплатах чи інших числових даних.

In [ ]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    MEDIAN("Salary") OVER (PARTITION BY "Department") as MedianSalary
FROM
    employees_cleaned;
"""

df_median = pd.read_sql_query(query, engine)
print(df_median)

у даному випадку не підтримується

**Віконні функції в SQL не зберігаються як окремі об’єкти в базі даних, але ви можете зберегти результати їх виконання у вигляді нових таблиць або додаткових стовпців у наявних таблицях. Ось кілька способів, як це можна зробити:**



*   **Створення нової таблиці з результатами:**


```
CREATE TABLE employees_with_ranks AS
SELECT
    "Employee Name",
    "Department",
    "Salary",
    RANK() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as Rank,
    LAG("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as PrevSalary,
    LEAD("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as NextSalary
FROM
    employees_cleaned;

```


*   **Додавання стовпців до наявної таблиці:**


```
ALTER TABLE employees_cleaned
ADD COLUMN Rank INT,
ADD COLUMN PrevSalary DECIMAL,
ADD COLUMN NextSalary DECIMAL;

UPDATE employees_cleaned
SET Rank = subquery.Rank,
    PrevSalary = subquery.PrevSalary,
    NextSalary = subquery.NextSalary
FROM (
    SELECT
        "Employee Name",
        RANK() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as Rank,
        LAG("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as PrevSalary,
        LEAD("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as NextSalary
    FROM
        employees_cleaned
) as subquery
WHERE employees_cleaned."Employee Name" = subquery."Employee Name";

```



*   **Створення представлень (views)**
Ви можете створити представлення, яке буде зберігати запит з віконними функціями. Представлення не зберігає дані фізично, але дозволяє легко виконувати запит.


```
CREATE VIEW employees_with_ranks AS
SELECT
    "Employee Name",
    "Department",
    "Salary",
    RANK() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as Rank,
    LAG("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as PrevSalary,
    LEAD("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as NextSalary
FROM
    employees_cleaned;

```

In [43]:
from sqlalchemy import text

query_create_view = text("""
CREATE OR REPLACE VIEW public.avg_salary_by_department AS
SELECT
    "Employee Name",
    "Department",
    "Salary",
    AVG("Salary") OVER (PARTITION BY "Department") as AvgSalary
FROM
    employees_cleaned;
""")

with engine.connect() as connection:
    connection.execute(query_create_view)
print("View 'avg_salary_by_department' створено.")

View 'avg_salary_by_department' створено.